app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO "authorizations" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Tue, 30 Oct 2012 06:47:47 UTC +00:00], ["provider", "facebook"], ["uid", "648175365"], ["updated_at", Tue, 30 Oct 2012 06:47:47 UTC +00:00], ["user_id", 4]]
---
def create
  auth_hash = request.env['omniauth.auth']
  if session[:user_id]
    # Means our user is signed in. Add the authorization to the user
    User.find(session[:user_id]).add_provider(auth_hash)
    render :text => "You can now login using #{auth_hash["provider"].capitalize} too!"
  else
    # Log him in or sign him up
    auth = Authorization.find_or_create(auth_hash)